---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures
source: html/8c3da786-2a8d-be03-d241-98aee42decc6.htm
---
# BuiltInFailures.RebarCouplerFailures Properties

The constraints between the coupler and the two connected bars are no longer satisfied. Post error to delete the coupler.